In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame({'key1':['a','a','b','b','a'], 'key2':['one','two','one','two','one'], 'data1':np.random.randn(5), 'data2':np.random.randn(5)})

In [4]:
df

  key1 key2     data1     data2
0    a  one -0.701789  1.937611
1    a  two -0.489300 -0.725708
2    b  one  0.721178 -1.082628
3    b  two -0.931745 -0.956702
4    a  one -0.850199  0.303583

In [5]:
grouped = df['data1'].groupby(df['key1'])

In [6]:
grouped

In [7]:
grouped.mean()

key1
a   -0.680429
b   -0.105284
Name: data1, dtype: float64

In [8]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [9]:
means

key1  key2
a     one    -0.775994
      two    -0.489300
b     one     0.721178
      two    -0.931745
Name: data1, dtype: float64

In [10]:
means.unstack()

key2       one       two
key1
a    -0.775994 -0.489300
b     0.721178 -0.931745

In [11]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [12]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.701789  1.937611
1    a  two -0.489300 -0.725708
4    a  one -0.850199  0.303583
b
  key1 key2     data1     data2
2    b  one  0.721178 -1.082628
3    b  two -0.931745 -0.956702

In [13]:
pieces = dict(list(df.groupby('key1')))

In [14]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one -0.701789  1.937611
 1    a  two -0.489300 -0.725708
 4    a  one -0.850199  0.303583,
 'b':   key1 key2     data1     data2
 2    b  one  0.721178 -1.082628
 3    b  two -0.931745 -0.956702}

In [15]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [16]:
grouped = df.groupby(df.dtypes, axis=1)

In [17]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.701789  1.937611
1 -0.489300 -0.725708
2  0.721178 -1.082628
3 -0.931745 -0.956702
4 -0.850199  0.303583
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [18]:
df.groupby('key1')['data1']

In [19]:
df['data1'].groupby(df['key1'])

In [20]:
s_grouped = df.groupby(['key1','key2'])['data2']

In [21]:
s_grouped

In [22]:
s_grouped.mean()

key1  key2
a     one     1.120597
      two    -0.725708
b     one    -1.082628
      two    -0.956702
Name: data2, dtype: float64

In [23]:
people = pd.DataFrame(np.random.randn(5,5), columns = ['a','b','c','d','e'], index=['Joe','steve','Wes','Jim','Travis'])

In [24]:
people

               a         b         c         d         e
Joe     1.541182 -0.749668 -1.418313 -1.582427 -0.447187
steve  -0.072961 -0.438652 -0.463501 -0.067641 -1.305334
Wes    -0.225526  0.651985 -0.563103  0.133078  0.379242
Jim     0.914595 -1.343563 -0.465968  0.180793 -0.864546
Travis -1.069903 -0.509519 -0.344982  0.362090  0.304084

In [25]:
people.iloc[2:3,[1,2]] = np.nan

In [26]:
people

               a         b         c         d         e
Joe     1.541182 -0.749668 -1.418313 -1.582427 -0.447187
steve  -0.072961 -0.438652 -0.463501 -0.067641 -1.305334
Wes    -0.225526       NaN       NaN  0.133078  0.379242
Jim     0.914595 -1.343563 -0.465968  0.180793 -0.864546
Travis -1.069903 -0.509519 -0.344982  0.362090  0.304084

In [27]:
mapping = {'a':'red', 'b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [28]:
by_columns = people.groupby(mapping, axis=1)

In [29]:
by_columns.sum()

            blue       red
Joe    -3.000740  0.344327
steve  -0.531141 -1.816947
Wes     0.133078  0.153716
Jim    -0.285175 -1.293515
Travis  0.017108 -1.275338

In [30]:
df

  key1 key2     data1     data2
0    a  one -0.701789  1.937611
1    a  two -0.489300 -0.725708
2    b  one  0.721178 -1.082628
3    b  two -0.931745 -0.956702
4    a  one -0.850199  0.303583

In [32]:
grouped = df.groupby('key1')

In [33]:
grouped['data1'].quantile(0.9)

key1
a   -0.531798
b    0.555885
Name: data1, dtype: float64

In [36]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [37]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.360899  2.663319
b     1.652923  0.125926

In [38]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.680429  0.181395 -0.850199 -0.775994 -0.701789 -0.595544
b      2.0 -0.105284  1.168793 -0.931745 -0.518515 -0.105284  0.307947

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a    -0.489300   3.0  0.505162  1.343054 -0.725708 -0.211062  0.303583
b     0.721178   2.0 -1.019665  0.089043 -1.082628 -1.051146 -1.019665


           75%       max
key1
a     1.120597  1.937611
b    -0.988183 -0.956702

In [39]:
tips = pd.read_csv('pydata-book/examples/tips.csv')

In [40]:
tips['tip_pct'] = tips['tip']/tips['total_bill']

In [41]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [42]:
grouped = tips.groupby(['day','smoker'])

In [43]:
grouped_pct = grouped['tip_pct']

In [44]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [45]:
tips.groupby(['day','smoker']).mean()

             total_bill       tip      size   tip_pct
day  smoker
Fri  No       18.420000  2.812500  2.250000  0.151650
     Yes      16.813333  2.714000  2.066667  0.174783
Sat  No       19.661778  3.102889  2.555556  0.158048
     Yes      21.276667  2.875476  2.476190  0.147906
Sun  No       20.506667  3.167895  2.929825  0.160113
     Yes      24.120000  3.516842  2.578947  0.187250
Thur No       17.113111  2.673778  2.488889  0.160298
     Yes      19.190588  3.030000  2.352941  0.163863

In [47]:
tips.groupby(['day','smoker'])['tip_pct'].mean()

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [48]:
grouped_pct.agg(['mean','std',peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [49]:
grouped.agg({'tip':[('min_value','min'),('max_value','max'),('mean_value','mean'),'std'], 'size':'sum'})

                  tip                                size
            min_value max_value mean_value       std  sum
day  smoker
Fri  No          1.50      3.50   2.812500  0.898494    9
     Yes         1.00      4.73   2.714000  1.077668   31
Sat  No          1.00      9.00   3.102889  1.642088  115
     Yes         1.00     10.00   2.875476  1.630580  104
Sun  No          1.01      6.00   3.167895  1.224785  167
     Yes         1.50      6.50   3.516842  1.261151   49
Thur No          1.25      6.70   2.673778  1.282964  112
     Yes         2.00      5.00   3.030000  1.113491   40

In [52]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [53]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [54]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [55]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [56]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [58]:
result.unstack()

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [59]:
tips.groupby('smoker',group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345